In [1]:
from bs4 import BeautifulSoup
import time
import pandas as pd
import requests

In [2]:
url1= "https://www.worlddata.info/cost-of-living.php"
page = requests.get(url1)
page

In [3]:
soup = BeautifulSoup(page.content, 'html.parser')

In [8]:
table=list(soup.find_all('tr'))

In [10]:
table_without_head=list(table[0].next_siblings)

In [14]:
table_without_head[1].td.next_sibling.next_sibling.next_sibling.text

'7,550 USD'

In [15]:
table_without_head[1].a.string

'Switzerland'

In [17]:
int(len(table_without_head))

105

In [19]:
table_country=[]
table_salary=[]
for i in range(len(table_without_head)):
    table_country.append(table_without_head[i].a.string),
    table_salary.append(table_without_head[i].td.next_sibling.next_sibling.next_sibling.text)

In [20]:
average_salary=pd.concat((pd.DataFrame(table_country),pd.DataFrame(table_salary)),axis=1)

In [21]:
average_salary

                  0           0
0           Bermuda  10,206 USD
1       Switzerland   7,550 USD
2    Cayman Islands   5,157 USD
3            Israel   4,108 USD
4           Iceland   5,288 USD
..              ...         ...
100         Myanmar      98 USD
101        Pakistan     123 USD
102      Kyrgyzstan      98 USD
103      Tajikistan      96 USD
104      Uzbekistan     163 USD

[105 rows x 2 columns]

In [22]:
average_salary.columns = ["country", "avg_salary"]

In [15]:
import os 

current_dir = os.getcwd() 
relative_path=os.path.abspath(os.path.join(current_dir, os.pardir))

In [16]:
data = pd.DataFrame(pd.read_csv(
    relative_path+"\\get_conversion_rate\\converted_salary.csv",usecols=[1,2,4]))

In [17]:
average_salary

        country avg_salary
0        Monaco  186,080 $
1       Bermuda  122,470 $
2   Switzerland   90,600 $
3    Luxembourg   88,190 $
4        Norway   83,880 $
..          ...        ...
62     Cambodia    1,580 $
63     Pakistan    1,470 $
64        Nepal    1,220 $
65      Myanmar    1,170 $
66  Afghanistan      390 $

[67 rows x 2 columns]

In [18]:
average_salary['avg_salary'] = average_salary['avg_salary'].str.split(' ').str[0]

In [19]:
average_salary

        country avg_salary
0        Monaco    186,080
1       Bermuda    122,470
2   Switzerland     90,600
3    Luxembourg     88,190
4        Norway     83,880
..          ...        ...
62     Cambodia      1,580
63     Pakistan      1,470
64        Nepal      1,220
65      Myanmar      1,170
66  Afghanistan        390

[67 rows x 2 columns]

In [20]:
data=data.merge(average_salary[['country','avg_salary']], on ='country', how = 'left')

In [21]:
data.to_csv(relative_path+"\\Web_Scraping\\data_without_costliving.csv")